export const mockupData = [
    {
        name: 'PTTC237A',
        description: 'หุ้นกู้เพื่ออนุรักษ์สิ่งแวดล้อมของบริษัท ปตท. จำกัด (มหาชน) ครั้งที่ 1/2563 ครบกำหนดไถ่ถอนปี พ.ศ. 2566'
    },
    {
        name: 'SIRI267A',
        description: 'หุ้นกู้ดิจิตอลของบริษัท แสนสิริ จำกัด (มหาชน) ครั้งที่ 3/2565 ชุดที่ 2 ครบกำหนดไถ่ถอน ปี พ.ศ. 2569'
    },
    {
        name: 'SIRI267B',
        description: 'หุ้นกู้ดิจิตอลของบริษัท แสนสิริ จำกัด (มหาชน) ครั้งที่ 3/2565 ชุดที่ 2 ครบกำหนดไถ่ถอน ปี พ.ศ. 2569'
    },
    {
        name: 'GULF298A',
        description:'หุ้นกู้ดิจิตอลของบริษัท กัลฟ์ เอ็นเนอร์จี ดีเวลลอปเมนท์ จำกัด (มหาชน) ครั้งที่ 3/2565 ชุดที่ 3 ครบกำหนดไถ่ถอนปี พ.ศ. 2572'
    },
    {
        name: 'BCP260AA',
        description:'หุ้นกู้ดิจิตอลของบริษัท บางจาก คอร์ปอเรชั่น จำกัด (มหาชน) ครั้งที่ 2/2565 ครบกำหนดไถ่ถอนปี พ.ศ.2569'
    },  {
        name: 'SIRI267AL',
        description: 'หุ้นกู้ดิจิตอลของบริษัท แสนสิริ จำกัด (มหาชน) ครั้งที่ 3/2565 ชุดที่ 2 ครบกำหนดไถ่ถอน ปี พ.ศ. 2569'
    },
    {
        name: 'SIRI267BD',
        description: 'หุ้นกู้ดิจิตอลของบริษัท แสนสิริ จำกัด (มหาชน) ครั้งที่ 3/2565 ชุดที่ 2 ครบกำหนดไถ่ถอน ปี พ.ศ. 2569'
    },
    {
        name: 'GULF298AG',
        description:'หุ้นกู้ดิจิตอลของบริษัท กัลฟ์ เอ็นเนอร์จี ดีเวลลอปเมนท์ จำกัด (มหาชน) ครั้งที่ 3/2565 ชุดที่ 3 ครบกำหนดไถ่ถอนปี พ.ศ. 2572'
    },
    {
        name: 'BCP260AT',
        description:'หุ้นกู้ดิจิตอลของบริษัท บางจาก คอร์ปอเรชั่น จำกัด (มหาชน) ครั้งที่ 2/2565 ครบกำหนดไถ่ถอนปี พ.ศ.2569'
    }
]